# Useful APIs of pandas

@author glin

In [113]:
import pandas as pd
import numpy as np

In [130]:
# create dataframe
df = pd.DataFrame([[np.NaN,'2','6'], ['3', '4','4'], ['1', '5',np.NaN], ['1', np.NaN,'3']], columns = ['a','b','c'])
df

     a    b    c
0  NaN    2    6
1    3    4    4
2    1    5  NaN
3    1  NaN    3

In [131]:
# group by a and count number of rows of all columns except 'a' 
# even if they are duplicate
# only for non-NaN 
df.groupby('a').count()

   b  c
a
1  1  1
3  1  1

In [132]:
# group by a and count number of rows for 'a'
# only for non-NaN
df.a.value_counts()#.count()

1    2
3    1
Name: a, dtype: int64

In [ ]:
# count distinct a
df.a.value_counts().count()

In [ ]:
# convert series to dataframe
s = pd.Series(['1', '2'])
s

In [ ]:
df1 = pd.DataFrame(s, columns = ['a'])
df1

In [ ]:
df1 = s.to_frame(name = 'a')
df1

In [ ]:
# convert string to float
df1.a = df1.a.astype(float)

In [ ]:
# check type
type(df1.a)

In [ ]:
df1.a.dtype

In [ ]:
df1

In [105]:
# convert string with $ to float
dollarizer = lambda x: float(x[1:-1])
df = pd.DataFrame([['@1.2','2'], ['$3.1', '4']], columns = ['a','b'])
df = df.a.apply(dollarizer)
df

0    1.0
1    3.0
Name: a, dtype: float64

In [56]:
# groupby a column and then sum, this will sum the rows of all columns
# if the values are string, the sum will concat string
df.groupby('a').sum()

a
1    254
3      4
Name: b, dtype: object

In [57]:
# sort
df.sort_values(['b'], ascending=False)

   a  b
2  1  5
1  3  4
3  1  4
0  1  2

In [62]:
# select where condition
# filter by value
df[df['b'] == '2']

   a  b
0  1  2

In [65]:
df[[True, False, False, False]]

   a  b
0  1  2

In [ ]:
# use in clause
df[df['b'].isin(['2','5'])]

In [69]:
# use not in clause
df[~df['b'].isin(['2','5'])]

   a  b
1  3  4
3  1  4

In [93]:
df['b'].isin(['2','5'])

0     True
1    False
2     True
3    False
Name: b, dtype: bool

In [94]:
df['a']=='1'

0     True
1    False
2     True
3     True
Name: a, dtype: bool

In [100]:
df['b'].isin(['2','5']) & df['a']=='1'

0    False
1    False
2    False
3    False
dtype: bool

In [99]:
# Have to use () when using &
(df['b'].isin(['2','5'])) & (df['a']=='1')

0     True
1    False
2     True
3    False
dtype: bool

In [101]:
# sort
df.b.sort_values(ascending=False)

2    5
3    4
1    4
0    2
Name: b, dtype: object

In [103]:
# sum specific columns
df.groupby('a')['b'].sum(axis = 1, skipna = True)

a
1    254
3      4
Name: b, dtype: object

In [104]:
df.groupby('a')['b'].sum()

a
1    254
3      4
Name: b, dtype: object